# pandas funtions

In [3]:
import pandas as pd
csv_1 = pd.read_csv("C:\\Users\\ASUS\\OneDrive\\Desktop\\pandas\\Test_new2.csv")
print(csv_1)
print()

   a  b  c   d   e   f        g
0  1  1  1  11  11  12    bablu
1  2  2  2  23  22  13   vishal
2  3  3  3  45  33  14     aman
3  4  4  4  66  44  15  deepack
4  5  5  5  77  55  16       44
5  6  6  6  88  66  50       40

# Accessing the elemnts index in csv file

In [4]:
csv_1.index

RangeIndex(start=0, stop=6, step=1)

# Accessing the elemnts  in csv file cloumns (index of cloumns )

In [5]:
csv_1.columns

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g'], dtype='object')

# describe funtion ()

In [8]:
# here we can find mix and min 
csv_1.describe()

              a         b         c          d          e          f
count  6.000000  6.000000  6.000000   6.000000   6.000000   6.000000
mean   3.500000  3.500000  3.500000  51.666667  38.500000  20.000000
std    1.870829  1.870829  1.870829  30.618077  20.579116  14.764823
min    1.000000  1.000000  1.000000  11.000000  11.000000  12.000000
25%    2.250000  2.250000  2.250000  28.500000  24.750000  13.250000
50%    3.500000  3.500000  3.500000  55.500000  38.500000  14.500000
75%    4.750000  4.750000  4.750000  74.250000  52.250000  15.750000
max    6.000000  6.000000  6.000000  88.000000  66.000000  50.000000

# starting datas ---->  head funtions ()

In [9]:
# here accessing starting datas(four to five ) given csv files 

csv_1.head()   # accesing form the above

   a  b  c   d   e   f        g
0  1  1  1  11  11  12    bablu
1  2  2  2  23  22  13   vishal
2  3  3  3  45  33  14     aman
3  4  4  4  66  44  15  deepack
4  5  5  5  77  55  16       44

In [10]:
# here accessing starting datas if only one  

csv_1.head(2)  # for accessing two data

   a  b  c   d   e   f       g
0  1  1  1  11  11  12   bablu
1  2  2  2  23  22  13  vishal

In [16]:
# here accessing starting datas if only one  

csv_1.head(3)  # for accessing 3 data and etc.

   a  b  c   d   e   f       g
0  1  1  1  11  11  12   bablu
1  2  2  2  23  22  13  vishal
2  3  3  3  45  33  14    aman

# tail() funtions -------> down 5 data

In [14]:
# here we accessing form down to above in the csv file (4 to 5 approx )

csv_1.tail()

   a  b  c   d   e   f        g
1  2  2  2  23  22  13   vishal
2  3  3  3  45  33  14     aman
3  4  4  4  66  44  15  deepack
4  5  5  5  77  55  16       44
5  6  6  6  88  66  50       40

In [17]:
# here we accessing form down to above in the csv file (4 to 5 approx )

csv_1.tail(3)

   a  b  c   d   e   f        g
3  4  4  4  66  44  15  deepack
4  5  5  5  77  55  16       44
5  6  6  6  88  66  50       40

In [18]:
# here we accessing form down to above in the csv file (4 to 5 approx )

csv_1.tail(1)

   a  b  c   d   e   f   g
5  6  6  6  88  66  50  40

# creating new csv file here

In [19]:
# here we accessing form down to above in the csv file (4 to 5 approx )

csv_1.tail(2)

   a  b  c   d   e   f   g
4  5  5  5  77  55  16  44
5  6  6  6  88  66  50  40

In [30]:
import pandas as pd 
dis = {"col1":[1111,2222,3333,4444,5555],"col2":[5555,6666,7777,8888,9999],"col3":[1211,1311,1411,1511],"col4":[1222,1233,1244,1255,1266],"col5":["vaishal","aman","bablu","1000",2222]
,"col6":[2344,1132,1414,1451,5768]}

print(dis)
d = pd.Dataframe(dis)
print(d)
print()

{'col1': [1111, 2222, 3333, 4444, 5555], 'col2': [5555, 6666, 7777, 8888, 9999], 'col3': [1211, 1311, 1411, 1511], 'col4': [1222, 1233, 1244, 1255, 1266], 'col5': ['vaishal', 'aman', 'bablu', '1000', 2222], 'col6': [2344, 1132, 1414, 1451, 5768]}

AttributeError: module 'pandas' has no attribute 'Dataframe'